wind-tunnel/ahmed/case/0/U
FoamFile { version 2.0; format ascii; class volVectorField; object U; }
dimensions [0 1 -1 0 0 0 0];
internalField uniform (40 0 0);
boundaryField
{
    inlet    { type fixedValue; value uniform (40 0 0); }
    outlet   { type inletOutlet; inletValue uniform (0 0 0); value uniform (40 0 0); }
    ground   { type fixedValue; value uniform (40 0 0); }
    "(top|side)" { type slip; }
    symmetry { type symmetryPlane; }
    ahmed    { type noSlip; }
}
