wind-tunnel/ahmed/case/0/k
FoamFile { version 2.0; format ascii; class volScalarField; object k; }
dimensions [0 2 -2 0 0 0 0];
internalField uniform 0.06;
boundaryField
{
    inlet    { type fixedValue; value uniform 0.06; }
    outlet   { type inletOutlet; inletValue uniform 0.06; value uniform 0.06; }
    "(ground|ahmed)" { type kqRWallFunction; value uniform 0.06; }
    "(top|side)" { type slip; }
    symmetry { type symmetryPlane; }
}
