wind-tunnel/ahmed/case/0/nut
FoamFile { version 2.0; format ascii; class volScalarField; object nut; }
dimensions [0 2 -1 0 0 0 0];
internalField uniform 0;
boundaryField
{
    "(inlet|outlet)" { type calculated; value uniform 0; }
    "(ground|ahmed)" { type nutkWallFunction; value uniform 0; }
    "(top|side)" { type slip; }
    symmetry { type symmetryPlane; }
}
