wind-tunnel/ahmed/case/0/omega
FoamFile { version 2.0; format ascii; class volScalarField; object omega; }
dimensions [0 0 -1 0 0 0 0];
internalField uniform 45;
boundaryField
{
    inlet    { type fixedValue; value uniform 45; }
    outlet   { type inletOutlet; inletValue uniform 45; value uniform 45; }
    "(ground|ahmed)" { type omegaWallFunction; value uniform 45; }
    "(top|side)" { type slip; }
    symmetry { type symmetryPlane; }
}
