wind-tunnel/ahmed/case/system/blockMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }
// half model: y >= 0 is the fluid, y = 0 is the symmetry plane. Units: m.
vertices ( (-2 0 0) (5 0 0) (5 1.2 0) (-2 1.2 0) (-2 0 1.4) (5 0 1.4) (5 1.2 1.4) (-2 1.2 1.4) );
blocks ( hex (0 1 2 3 4 5 6 7) (88 15 18) simpleGrading (1 1 1) );
boundary
(
    inlet    { type patch; faces ((0 4 7 3)); }
    outlet   { type patch; faces ((1 2 6 5)); }
    ground   { type wall;  faces ((0 3 2 1)); }
    top      { type patch; faces ((4 5 6 7)); }
    side     { type patch; faces ((3 7 6 2)); }
    symmetry { type symmetryPlane; faces ((0 1 5 4)); }
);
