wind-tunnel/ahmed/case/system/controlDict
FoamFile { version 2.0; format ascii; class dictionary; object controlDict; }
application simpleFoam;
startFrom latestTime; startTime 0; stopAt endTime; endTime 800; deltaT 1;
writeControl timeStep; writeInterval 800; purgeWrite 1;
writeFormat binary; writePrecision 8; timeFormat general; timePrecision 6; runTimeModifiable true;
functions
{
    forceCoeffs
    {
        type forceCoeffs; libs (forces); writeControl timeStep; writeInterval 1;
        patches (ahmed); rho rhoInf; rhoInf 1;
        CofR (0.522 0 0.194); liftDir (0 0 1); dragDir (1 0 0); pitchAxis (0 1 0);
        magUInf 40; lRef 1.044;
        Aref 0.056016;   // half of the frontal area 0.389 x 0.288 (half model)
    }
}
