wind-tunnel/ahmed/case/system/snappyHexMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object snappyHexMeshDict; }
castellatedMesh true;
snap            true;
addLayers       false;
geometry
{
    ahmed.stl { type triSurfaceMesh; name ahmed; }
    nearBody { type searchableBox; min (-0.3 0 0); max (1.6 0.4 0.55); }
    wake     { type searchableBox; min (-0.5 0 0); max (3.0 0.6 0.8); }
}
castellatedMeshControls
{
    maxLocalCells 2000000; maxGlobalCells 4000000; minRefinementCells 10;
    maxLoadUnbalance 0.10; nCellsBetweenLevels 3;
    features ( { file "ahmed.eMesh"; level 4; } );
    refinementSurfaces { ahmed { level (3 4); patchInfo { type wall; } } }
    resolveFeatureAngle 30;
    refinementRegions
    {
        nearBody { mode inside; levels ((1E15 3)); }
        wake     { mode inside; levels ((1E15 2)); }
    }
    locationInMesh (3.0 0.9 1.0);
    allowFreeStandingZoneFaces true;
}
snapControls { nSmoothPatch 3; tolerance 2.0; nSolveIter 50; nRelaxIter 5; nFeatureSnapIter 10; implicitFeatureSnap false; explicitFeatureSnap true; multiRegionFeatureSnap false; }
addLayersControls { relativeSizes true; layers {} expansionRatio 1.2; finalLayerThickness 0.5; minThickness 0.1; nGrow 0; featureAngle 60; nRelaxIter 3; nSmoothSurfaceNormals 1; nSmoothNormals 3; nSmoothThickness 10; maxFaceThicknessRatio 0.5; maxThicknessToMedialRatio 0.3; minMedialAxisAngle 90; nBufferCellsNoExtrude 0; nLayerIter 50; }
// conda-forge openfoam=2412 does not ship etc/caseDicts, so #includeEtc
// "caseDicts/mesh/generation/meshQualityDict" fails; the standard values are inlined.
meshQualityControls
{
    maxNonOrtho 65; maxBoundarySkewness 20; maxInternalSkewness 4; maxConcave 80;
    minVol 1e-13; minTetQuality 1e-15; minArea -1; minTwist 0.02; minDeterminant 0.001;
    minFaceWeight 0.05; minVolRatio 0.01; minTriangleTwist -1;
    nSmoothScale 4; errorReduction 0.75;
    relaxed { maxNonOrtho 75; }
}
mergeTolerance 1e-6;
