wind-tunnel/ahmed/case/system/surfaceFeatureExtractDict
FoamFile { version 2.0; format ascii; class dictionary; object surfaceFeatureExtractDict; }
ahmed.stl { extractionMethod extractFromSurface; includedAngle 150; writeObj no; }
